---
type: AssetProperties
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 5
tags: [revit-api, class]
---

# AssetProperties

`Autodesk.Revit.DB.Visual.AssetProperties` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | FindByName | 2018.1 | `public AssetProperty FindByName ( string name )` |
| Method | Get | 2019 | `public AssetProperty Get ( int index )` |
| Method | IsValidIndex | 2019 | `public bool IsValidIndex ( int index )` |
| Property | Item | — | `public AssetProperty this [ int index ] { get ; }` |
| Property | Size | — | `public int Size { get ; }` |